
### :robot: Terraform Report
---
##### Plan: `1` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcloud_server.node will be created
  + resource "hcloud_server" "node" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "debian-12"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + location                   = "nbg1"
      + name                       = "node0"
      + rebuild_protection         = false
      + server_type                = "cx31"
      + ssh_keys                   = [
          + "max",
        ]
      + status                     = (known after apply)
      + user_data                  = "W6QU7ASjNfCQwbKmLFF5kgFtjuM="

      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + node_ipv4_address          = (known after apply)

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#5661589081`](https://github.com/small-hack/vmt-terraform-hetzner/actions/runs/5661589081) - commit de7aa60817f1aee00a66f6487550546f0a82d684
